{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Домашнее задание к лекции \"Функции\"\n",
    "Вам нужно помочь секретарю автоматизировать работу. \n",
    "Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду p\n",
      "Введите номер документа 100\n",
      "Документа нет в базе\n",
      "Введите команду p\n",
      "Введите номер документа 10006\n",
      "Владелец документа  Аристарх Павлов\n",
      "Введите команду s\n",
      "Введите номер документа 34\n",
      "Документ хранится на полке  Документа нет в базе\n",
      "Введите команду s\n",
      "Введите номер документа 10006\n",
      "Документ хранится на полке  2\n",
      "Введите команду l\n",
      "№: 2207 876234 тип: passport владелец: Василий Гупкин полка хранения: 1\n",
      "№: 11-2 тип: invoice владелец: Геннадий Покемонов полка хранения: 1\n",
      "№: 10006 тип: insurance владелец: Аристарх Павлов полка хранения: 2\n",
      "Введите команду ads\n",
      "Введите номер полки: 1\n",
      "Такая полка уже существует. Текущий перечень полок:  ['1', '2', '3']\n",
      "Введите команду ads\n",
      "Введите номер полки: 5\n",
      "Полка добавлена. Текущий перечень полок: ['1', '2', '3', '5']\n",
      "Введите команду ds\n",
      "Введите номер полки:1\n",
      "На полке есть документы, удалите их перед удалением полки. Текущий перечень полок:  ['1', '2', '3', '5']\n",
      "Введите команду ds\n",
      "Введите номер полки:5\n",
      "Полка удалена. Текущий перечень полок: ['1', '2', '3']\n",
      "Введите команду q\n",
      "Программа закончена\n"
     ]
    }
   ],
   "source": [
    "### Задание 1\n",
    "def _p(documents):   #Пункт 1. Пользователь по команде \"p\" может узнать владельца документа по его номеру\n",
    "    doc_num = input(\"Введите номер документа \")\n",
    "    for doc in documents:\n",
    "        if doc_num == doc['number']:\n",
    "            print('Владелец документа ', doc['name'])\n",
    "            return()\n",
    "    else:\n",
    "        print('Документа нет в базе')\n",
    "            \n",
    "            \n",
    "def _s(directors):    #Пункт 2. Пользователь по команде \"s\" может по номеру документа узнать на какой полке он хранитсяp\n",
    "        doc_num = input(\"Введите номер документа \")\n",
    "        directory = 0\n",
    "        for diret, nums in directors.items():\n",
    "            if doc_num in nums:\n",
    "                directory = diret\n",
    "                break\n",
    "            else:\n",
    "                directory = 'Документа нет в базе'\n",
    "        print('Документ хранится на полке ',directory)\n",
    "        \n",
    "def _l(documents):  #Пункт 3. Пользователь по команде \"l\" может увидеть полную информацию по всем документам\n",
    "    for info in documents:\n",
    "        for key, val in directories.items():\n",
    "            for Val in val:\n",
    "                if info['number'] == Val:\n",
    "                    print('№:', info['number'] , 'тип:' , info['type'] , 'владелец:' , info['name'] , 'полка хранения:' , key)\n",
    "                    \n",
    "def _ads(directories):   #Пункт 4. Пользователь по команде \"ads\" может добавить новую полку\n",
    "    doc_num = input(\"Введите номер полки: \")\n",
    "    for abasl in directories.items():\n",
    "        if doc_num in abasl[0]:\n",
    "            print('Такая полка уже существует. Текущий перечень полок: ', list(directories.keys()))\n",
    "            break\n",
    "    else:\n",
    "        directories[doc_num] = []\n",
    "        print('Полка добавлена. Текущий перечень полок:', list(directories.keys()))\n",
    "        \n",
    "def _ds(documents, directories):\n",
    "    doc_num = input(\"Введите номер полки:\")\n",
    "    if doc_num not in directories.keys():\n",
    "        print('Такой полки не существует. Текущий перечень полок:', list(directories.keys()))\n",
    "    elif len (directories[doc_num]) > 0:\n",
    "        print ('На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: ', list(directories.keys()))\n",
    "    else:\n",
    "        del(directories[doc_num])\n",
    "        print('Полка удалена. Текущий перечень полок:', list(directories.keys()))\n",
    "\n",
    "            \n",
    "def main():\n",
    "    while True:\n",
    "        user = input('Введите команду ')\n",
    "        if user == 'p':\n",
    "            _p(documents)\n",
    "        elif user == 's':\n",
    "            _s(directories)\n",
    "        elif user == 'l':\n",
    "            _l(documents)\n",
    "        elif user == 'ads':\n",
    "            _ads(directories)\n",
    "        elif user == 'ds':\n",
    "            _ds(documents, directories)\n",
    "        elif user == 'q':\n",
    "            print('Программа закончена')\n",
    "            break\n",
    "main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
